"""
Написать рекурсивную функцию, которая принимат на вход список целых чисел
и возвращает максимальное число в списке
"""

def recursive_max(some_list):
    """
    Your code is here
    """
    pass

"""
Test
"""

source = [2, 1, 0, 5, 7, 6, 4, 3]
print(source)
assert recursive_max(source) == 7